In [1]:
# Import Dependencies
import pandas as pd
import sqlite3 as sql

Checking to see if converted sql file from Springboard database using bash script generates the same tables as the one provided in the exercise.

In [2]:
# Create connection to sql file
database1 = 'country_club.db'
connection1 = sql.connect(database1)

In [3]:
query1 = '''
SELECT *
FROM Bookings'''

query2 = '''
SELECT *
FROM Members'''

query3 = '''
SELECT *
FROM Facilities'''

In [4]:
df1 = pd.read_sql_query(query1, connection1)
df2 = pd.read_sql_query(query2, connection1)
df3 = pd.read_sql_query(query3, connection1)

In [5]:
# Create connection to sql file
database2 = 'sqlite_db_pythonsqlite.db'
connection2 = sql.connect(database2)

In [6]:
query4 = '''
SELECT *
FROM Bookings'''

query5 = '''
SELECT *
FROM Members'''

query6 = '''
SELECT *
FROM Facilities'''

In [7]:
df4 = pd.read_sql_query(query4, connection2)
df5 = pd.read_sql_query(query5, connection2)
df6 = pd.read_sql_query(query6, connection2)

In [8]:
df1.equals(df4)

True

In [9]:
df2.equals(df5)

True

In [10]:
df3.equals(df6)

True

Great! All three tables matches. Going to use converted file for the exercise.

In [11]:
# Create connection to sql file
database = 'country_club.db'
connection = sql.connect(database)

In [12]:
query_bookings = '''
SELECT *
FROM Bookings'''

query_members = '''
SELECT *
FROM Members'''

query_facilities = '''
SELECT *
FROM Facilities'''

In [13]:
df_bookings = pd.read_sql_query(query_bookings, connection)
df_members = pd.read_sql_query(query_members, connection)
df_facilities = pd.read_sql_query(query_facilities, connection)

In [14]:
df_bookings.head()

   bookid  facid  memid            starttime  slots
0       0      3      1  2012-07-03 11:00:00      2
1       1      4      1  2012-07-03 08:00:00      2
2       2      6      0  2012-07-03 18:00:00      2
3       3      7      1  2012-07-03 19:00:00      2
4       4      8      1  2012-07-03 10:00:00      1

In [15]:
df_members.head()

,memid,surname,firstname,address,zipcode,telephone,recommendedby,joindate
0,0,GUEST,GUEST,GUEST,0,(000) 000-0000,,2012-07-01 00:00:00
1,1,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,,2012-07-02 12:02:05
2,2,Smith,Tracy,"8 Bloomsbury Close, New York",4321,555-555-5555,,2012-07-02 12:08:23
3,3,Rownam,Tim,"23 Highway Way, Boston",23423,(844) 693-0723,,2012-07-03 09:32:15
4,4,Joplette,Janice,"20 Crossing Road, New York",234,(833) 942-4710,1,2012-07-03 10:25:05

In [16]:
df_facilities

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,0,Tennis Court 1,5.0,25.0,10000,200
1,1,Tennis Court 2,5.0,25.0,8000,200
2,2,Badminton Court,0.0,15.5,4000,50
3,3,Table Tennis,0.0,5.0,320,10
4,4,Massage Room 1,9.9,80.0,4000,3000
5,5,Massage Room 2,9.9,80.0,4000,3000
6,6,Squash Court,3.5,17.5,5000,80
7,7,Snooker Table,0.0,5.0,450,15
8,8,Pool Table,0.0,5.0,400,15

Q10. Produce a list of facilities with a total revenue less than 1000.
The output of facility name and total revenue, sorted by revenue. Remember that there's a different cost for guests and members!

In [17]:
# Q10
query_Q10 = '''
WITH guest AS (
    SELECT
        f.name,
        b.facid,
        SUM(b.slots) * f.guestcost AS guest_revenue
    FROM Bookings as b
    INNER JOIN Facilities as f
    USING(facid)
    WHERE b.memid = 0
    GROUP BY facid
),
members AS (
    SELECT
        f.name,
        b.facid,
        SUM(b.slots) * f.membercost AS member_revenue
    FROM Bookings as b
    INNER JOIN Facilities as f
    USING(facid)
    WHERE b.memid != 0
    GROUP BY facid
)

SELECT
    f.name,
    guest.guest_revenue + members.member_revenue AS revenue
FROM Bookings
INNER JOIN Facilities as f
USING(facid)
INNER JOIN guest
USING(facid)
INNER JOIN members
USING(facid)
GROUP BY facid
HAVING revenue < 1000
ORDER BY revenue DESC;'''

In [18]:
df_Q10 = pd.read_sql_query(query_Q10, connection)

In [19]:
df_Q10

            name  revenue
0     Pool Table      270
1  Snooker Table      240
2   Table Tennis      180

Q11. Produce a report of members and who recommended them in alphabetic surname,firstname order

In [20]:
# Q11
query_Q11 = '''
SELECT
    a.surname || ', ' || a.firstname AS surname_firstname,
    b.surname || ', ' || b.firstname AS recommededby_name
FROM Members AS a
LEFT JOIN Members AS b
ON a.recommendedby = b.memid
WHERE a.recommendedby != ''; -- apparently empty string '' is not null'''

In [21]:
df_Q11 = pd.read_sql_query(query_Q11, connection)

In [22]:
df_Q11

           surname_firstname   recommededby_name
0           Joplette, Janice       Smith, Darren
1            Butters, Gerald       Smith, Darren
2                Dare, Nancy    Joplette, Janice
3                Boothe, Tim         Rownam, Tim
4           Stibbons, Ponder       Tracy, Burton
5              Owen, Charles       Smith, Darren
6               Jones, David    Joplette, Janice
7                Baker, Anne    Stibbons, Ponder
8                Smith, Jack       Smith, Darren
9            Bader, Florence    Stibbons, Ponder
10            Baker, Timothy     Farrell, Jemima
11             Pinker, David     Farrell, Jemima
12          Genting, Matthew     Butters, Gerald
13           Mackenzie, Anna       Smith, Darren
14              Coplin, Joan      Baker, Timothy
15         Sarwin, Ramnaresh     Bader, Florence
16            Jones, Douglas        Jones, David
17         Rumney, Henrietta    Genting, Matthew
18  Worthington-Smyth, Henry        Smith, Tracy
19        Purview, Millicent        Smith, Tracy
20                Hunt, John  Purview, Millicent
21            Crumpet, Erica        Smith, Tracy

Q12. Find the facilities with their usage by member, but not guests

In [23]:
# Q12
query_Q12 = '''
SELECT
    f.name,
    ROUND(SUM(b.slots) * 1.0 / (SELECT SUM(slots) FROM Bookings) * 100, 2) AS member_percent_usage
FROM Bookings as b
INNER JOIN Facilities as f
USING(facid)
WHERE b.memid != 0
GROUP BY facid;'''

In [24]:
df_Q12 = pd.read_sql_query(query_Q12, connection)

In [25]:
df_Q12

              name  member_percent_usage
0   Tennis Court 1                 10.41
1   Tennis Court 2                  9.60
2  Badminton Court                 11.82
3     Table Tennis                  8.64
4   Massage Room 1                  9.62
5   Massage Room 2                  0.59
6     Squash Court                  4.55
7    Snooker Table                  9.36
8       Pool Table                  9.31

Q13. Find the facilities usage by month, but not guests

In [26]:
# Q13
query_Q13 = '''
WITH july AS (
    SELECT
        f.name,
        b.facid,
        ROUND(SUM(b.slots) * 1.0 / (SELECT SUM(slots) FROM Bookings) * 100, 2) AS jul_percent_usage
    FROM Bookings as b
    INNER JOIN Facilities as f
    USING(facid)
    WHERE strftime('%m', b.starttime) = '07'
    GROUP BY facid
),    
august AS (
    SELECT
        f.name,
        b.facid,
        ROUND(SUM(b.slots) * 1.0 / (SELECT SUM(slots) FROM Bookings) * 100, 2) AS aug_percent_usage
    FROM Bookings as b
    INNER JOIN Facilities as f
    USING(facid)
    WHERE strftime('%m', b.starttime) = '08'
    GROUP BY facid
),
september AS (
    SELECT
        f.name,
        b.facid,
        ROUND(SUM(b.slots) * 1.0 / (SELECT SUM(slots) FROM Bookings) * 100, 2) AS sept_percent_usage
    FROM Bookings as b
    INNER JOIN Facilities as f
    USING(facid)
    WHERE strftime('%m', b.starttime) = '09'
    GROUP BY facid
)
 
SELECT
    f.name,
    july.jul_percent_usage,
    august.aug_percent_usage,
    september.sept_percent_usage
FROM Bookings
INNER JOIN Facilities as f
USING(facid)
INNER JOIN july
USING(facid)
INNER JOIN august
USING(facid)
INNER JOIN september
USING(facid)
GROUP BY facid;'''

In [27]:
df_Q13 = pd.read_sql_query(query_Q13, connection)

In [28]:
df_Q13

              name  jul_percent_usage  aug_percent_usage  sept_percent_usage
0   Tennis Court 1               2.94               4.99                6.43
1   Tennis Court 2               2.25               5.26                6.40
2  Badminton Court               1.96               4.99                6.20
3     Table Tennis               1.13               3.31                4.59
4   Massage Room 1               2.87               5.35                7.05
5   Massage Room 2               0.26               0.89                1.33
6     Squash Court               1.78               4.35                5.88
7    Snooker Table               1.70               3.55                4.63
8       Pool Table               1.27               3.50                5.12